{"pageProps":{"title":"System Design Interviews: A step by step guide","description":"System Design Interviews: A step by step guide","date":"2020-06-01","slug":"system-design-interviews-a-step-by-step-guide","categories":["Interview"],"tags":["Interview"],"thumbnail":"","image":"","content":"\n# System Design Interviews: A step by step guide\n\n### Step 1: Requirements clarifications\n\nIt is always a good idea to ask questions about the exact scope of the problem we are solving. Design questions are mostly open-ended, and they don’t have ONE correct answer, that’s why clarifying ambiguities early in the interview becomes critical. Candidates who spend enough time to define the end goals of the system always have a better chance to be successful in the interview. Also, since we only have 35-40 minutes to design a (supposedly) large system, we should clarify what parts of the system we will be focusing on.\n\nLet’s expand this with an actual example of designing a Twitter-like service. Here are some questions for designing Twitter that should be answered before moving on to the next steps:\n\n- Will users of our service be able to post tweets and follow other people?\n- Should we also design to create and display the user’s timeline?\n- Will tweets contain photos and videos?\n- Are we focusing on the backend only or are we developing the front-end too?\n- Will users be able to search tweets?\n- Do we need to display hot trending topics?\n- Will there be any push notification for new (or important) tweets?\n\nAll such questions will determine how our end design will look like.\n\n\n### Step 2: Back-of-the-envelope estimation\nIt is always a good idea to estimate the scale of the system we’re going to design. This will also help later when we will be focusing on scaling, partitioning, load balancing and caching.\n\nWhat scale is expected from the system (e.g., number of new tweets, number of tweet views, number of timeline generations per sec., etc.)?\nHow much storage will we need? We will have different storage requirements if users can have photos and videos in their tweets.\nWhat network bandwidth usage are we expecting? This will be crucial in deciding how we will manage traffic and balance load between servers.\n\n\n### Step 3: System interface definition\nDefine what APIs are expected from the system. This will not only establish the exact contract expected from the system but will also ensure if we haven’t gotten any requirements wrong. Some examples of APIs for our Twitter-like service will be:\n\n```\ncreate(...)\nput(...)\nget(...)\n```\n\n### Step 4: Defining data model\n\nDefining the data model in the early part of the interview will clarify how data will flow between different components of the system. Later, it will guide for data partitioning and management. The candidate should be able to identify various entities of the system, how they will interact with each other, and different aspects of data management like storage, transportation, encryption, etc. Here are some entities for our Twitter-like service:\n\nUser: UserID, Name, Email, DoB, CreationData, LastLogin, etc.\nTweet: TweetID, Content, TweetLocation, NumberOfLikes, TimeStamp, etc.\nUserFollowo: UserdID1, UserID2\nFavoriteTweets: UserID, TweetID, TimeStamp\n\nWhich database system should we use? Will NoSQL like Cassandra best fit our needs, or should we use a MySQL-like solution? What kind of block storage should we use to store photos and videos?\n\n### Step 5: High-level design\nDraw a block diagram with 5-6 boxes representing the core components of our system. We should identify enough components that are needed to solve the actual problem from end-to-end.\n\nFor Twitter, at a high-level, we will need multiple application servers to serve all the read/write requests with load balancers in front of them for traffic distributions. If we’re assuming that we will have a lot more read traffic (as compared to write), we can decide to have separate servers for handling these scenarios. On the backend, we need an efficient database that can store all the tweets and can support a huge number of reads. We will also need a distributed file storage system for storing photos and videos.\n\n### Step 6: Detailed design\nDig deeper into two or three major components; interviewer’s feedback should always guide us to what parts of the system need further discussion. We should be able to present different approaches, their pros and cons, and explain why we will prefer one approach on the other. Remember there is no single answer; the only important thing is to consider tradeoffs between different options while keeping system constraints in mind.\n\nSince we will be storing a massive amount of data, how should we partition our data to distribute it to multiple databases? Should we try to store all the data of a user on the same database? What issue could it cause?\nHow will we handle hot users who tweet a lot or follow lots of people?\nSince users’ timeline will contain the most recent (and relevant) tweets, should we try to store our data in such a way that is optimized for scanning the latest tweets?\nHow much and at which layer should we introduce cache to speed things up?\nWhat components need better load balancing?\n\n### Step 7: Identifying and resolving bottlenecks\nTry to discuss as many bottlenecks as possible and different approaches to mitigate them.\n\nIs there any single point of failure in our system? What are we doing to mitigate it?\nDo we have enough replicas of the data so that if we lose a few servers, we can still serve our users?\nSimilarly, do we have enough copies of different services running such that a few failures will not cause total system shutdown?\nHow are we monitoring the performance of our service? Do we get alerts whenever critical components fail or their performance degrades?\n\n### Summary\nBe prepared and organized\n","permalink":"/post/system-design-interviews-a-step-by-step-guide","site":{"categories":[{"name":"Algorithm","count":1},{"name":"Design","count":10},{"name":"Development","count":37},{"name":"Interview","count":1},{"name":"Mobile-Development","count":1},{"name":"Resources","count":14},{"name":"System Design","count":1},{"name":"Tools","count":1},{"name":"Web Management","count":5},{"name":"Web-Development","count":36}],"tags":[{"name":".NET","count":2},{"name":"Algorithm","count":1},{"name":"AngularJS","count":4},{"name":"CSS","count":6},{"name":"HTML","count":3},{"name":"Interview","count":2},{"name":"JavaScript","count":26},{"name":"Mobile","count":1},{"name":"Node.JS","count":8},{"name":"React","count":1},{"name":"Tools","count":1}]}},"__N_SSG":true}