{"pageProps":{"title":".NET Interview Questions with Answers: Senior Developers/Architects","description":"Here is you find .NET Interview Questions with Answers. .NET Interview Questions mostly from Scott Hanselman website and other resources. I found a list of interview questions which should be known by .net guys at different levels.","date":"2016-09-01T16:24:54.017Z","lastmod":"2016-09-01T16:53:56.850Z","slug":"net-interview-questions-with-answers-senior-developers-architects","categories":["Web-Development","Development"],"tags":[".NET"],"thumbnail":"https://3.bp.blogspot.com/-L105BogpSO4/WhCdlPdIfuI/AAAAAAAAD2E/gBYZvPb4zEsnSMn8afHGLvQpGiAzadM7gCLcBGAs/s400/Microsoft-dotNET-logo.jpg","image":"https://3.bp.blogspot.com/-L105BogpSO4/WhCdlPdIfuI/AAAAAAAAD2E/gBYZvPb4zEsnSMn8afHGLvQpGiAzadM7gCLcBGAs/s1600/Microsoft-dotNET-logo.jpg","source":"","content":"\n\n**What’s wrong with a line like this? DateTime.Parse(myString);**\n\nIn addition the locale problem, DateTime.Parse() could also throw an exception which you would then have to catch. Use DateTime.TryParse() or DateTime.TryParseExact() instead.\n\n**What are PDBs? Where must they be located for debugging to work?**  \nPDB stands for Program database store debugging symbols and meta information for debugging. Normally they are located at bin or debug folder.\n\n**What is cyclomatic complexity and why is it important?**  \nIt's a measure of the number of independent linearly executed paths through a program.   \nIt's important for judging the complexity of software and assisting in determinations of which modules should be refactored into smaller components.\n\n**Write a standard lock() plus “double check” to create a critical section around a variable access.**\n\nObject objLock;   \nbool isLocked = true;   \nif (isLocked) {  \n    lock(objLock){  \n        if (isLocked) {  \n            notLocked = false;  \n            foo = lockingObject;  \n            notLocked = true;  \n        }  \n    }  \n}\n\n**What is FullTrust? Do GAC’ed assemblies have FullTrust?**  \nFullTrust means all .NET security permissions are granted to the assembly. GAC assemblies have FullTrust by default, but that can be changed by the user's security policy.\n\n**What benefit does your code receive if you decorate it with attributes demanding specific Security permissions?**  \nAllows administrators to see exactly which permissions your application needs to run;   \nprevents your code from being exploited beyond what permissions it absolutely needs;   \nallows your application to forcibly fail instead of having to manually handle situations where it might be denied permissions it requires.\n\n**What does this do? gacutil /l | find /i \"Corillian\"**  \nLists all assemblies in the GAC, searching for those whose names contain \"Corillian\".\n\n**What does this do? sn -t foo.dll**  \nShows the token for foo.dll.\n\n**What ports must be open for DCOM over a firewall? What is the purpose of Port 135?**  \nPort 135 is for windows RPC. DCOM is distributed COM technology which used to remote procedure call and it used port 135 by default. \n\n**Contrast OOP and SOA. What are tenets of each?**  \nOOP tries to encapsulate functionality required to operate on data with the data structure itself, making objects \"self-reliant\". (Application is built on objects, with inheritance, abstraction, polymorphism, encapsulation concepts.)  \nSOA aims to decouple functionality from data entirely, using interfaces to allow functional components to operate blindly with as   \nlittle understanding of the precise nature of the data they're fed as possible, allowing many types of data sets to be fed into them for the same operation.  \nSOA – In SOA we create an abstract layer to define a contract and rules. The client application doesn’t need to know how the service is implemented. The service layer will handle all the details of the implementation.\n\n**How does the XmlSerializer work? What ACL permissions does a process using it require?**  \nXmlSerializer used read/write interfaces to deserialize/serialize respectively xml based data. ReflectionPermission is required to use it.\n\n**Why is catch(Exception) almost always a bad idea?**  \nThis means that you swallow an exception and not do anything about it.   \nThere are very few cases when it's okay to do that, usually when you have an action you don't care if it failed or not,   \nor maybe you just care that it failed.\n\n**What is the difference between Debug.Write and Trace.Write? When should each be used?**  \nDebug.Write works on debug mode only. Trace.Write works in both debug and release mode.\n\n**What is the difference between a Debug and Release build? Is there a significant speed difference? Why or why not?**  \nDebug build contain debug symbols and can be debugged while release build doesn't contain debug symbols,   \ndoesn't have [Contional(\"DEBUG\")] methods calls compiled, can't be debugged (easily, that is), less checking, etc.   \nThere should be a speed difference, because of disabling debug methods, reducing code size etc but that is not a gurantee (at least not a signifcant one)\n\n**Does JITting occur per-assembly or per-method? How does this affect the working set?**  \nPer-method. Methods are not called are not compiled, this reduces the working set.\n\n**Contrast the use of an abstract base class against an interface?**  \nAbstract classes can provide implementations for methods and properties. Interfaces only provide required declarations.\n\n**What is the difference between a.Equals(b) and a == b?**  \nThe first uses the object's equivalency constructor to see if it considers itself value-equal to the the second object.   \nThe second construct compares their memory references to determine if they are the SAME object.\n\n**In the context of a comparison, what is object identity versus object equivalence?**  \nIdentity means that two references point to the same memory address. Equivalence means that two objects share the same value.\n\n**How would one do a deep copy in .NET?**  \nImplement IClonable? That is the way I would do it.\n\n**Explain current thinking around IClonable.**  \nThe Clone() method in the IClonable interface doesn’t have a parameter to indicate how the object is cloned.   \nIt could be a full value clone or just reference clone depending on how a class is implemented.\n\n**What is boxing?**  \nTo convert value type into reference type is called boxing. Take a value type like int in stack and put it to reference type (object) in heap.\n\n**Is string a value type or a reference type?**  \nIt's an \"illusionary value type\" that masks an interface to the System.String reference type.\n\n**What is the significance of the \"PropertySpecified\" pattern used by the XmlSerializer? What problem does it attempt to solve?**  \nDefines the specific parameters that .NET class members serialize into.   \nSolves the issue of an XML spec needing to have slightly different names for class members than the class itself does.\n\n**Why are out parameters a bad idea in .NET? Are they?**  \n Out parameters create uncertainty about the data which may be returned from the function,   \n and permit the caller to potentially pass bad references which your function must validate before using.   \n From a design standpoint, it's more elegant to define a custom class with multiple   \n properties in the event that you need to return multiple values from a single function.\n\n**Can attributes be placed on specific parameters to a method? Why is this useful?**  \nYes. This might be needed to specify remoting implementations  \nYes. It’s useful if you want to call COM objects and the types in .net need to be marshalled to types in COM.","permalink":"/post/net-interview-questions-with-answers-senior-developers-architects","site":{"categories":[{"name":"Algorithm","count":1},{"name":"Design","count":10},{"name":"Development","count":38},{"name":"interview","count":2},{"name":"intreview","count":2},{"name":"Mobile-Development","count":1},{"name":"Resources","count":15},{"name":"System Design","count":2},{"name":"System-Design","count":2},{"name":"Tools","count":1},{"name":"Web Management","count":5},{"name":"Web-Development","count":37}],"tags":[{"name":".NET","count":2},{"name":"Algorithm","count":1},{"name":"AngularJS","count":4},{"name":"CSS","count":7},{"name":"HTML","count":4},{"name":"interview","count":5},{"name":"interviews","count":1},{"name":"intreview","count":2},{"name":"JavaScript","count":27},{"name":"Mobile","count":1},{"name":"Node.JS","count":8},{"name":"React","count":1},{"name":"Tools","count":1}]}},"__N_SSG":true}