{"pageProps":{"title":"Facebook authentication in AngularJS web application","description":"In this post we are trying to implement a login system based on the Facebook’s authentication system.","date":"2015-05-20T10:25:41.010Z","lastmod":"2015-05-20T10:25:41.010Z","slug":"facebook-authentication-in-angularjs-web-application","categories":["Web-Development","Development"],"tags":["AngularJS","JavaScript"],"thumbnail":"http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/facebook-angular.png","image":"http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/facebook-angular.png","source":"","content":"\n\nIn this post we are trying to implement a login system based on the Facebook’s authentication system.\n\n## Authentication with Facebook\n\nWhen I started to work on the facebook authentication I was not a big expert in the matter of Facebook’s api in this case I think that the smarter thing you can do is start reading the Facebook’s document about [Facebook’s authentication system](https://developers.facebook.com/docs/facebook-login).\n\nYou’ll discover that Facebook makes available different ways to authenticate the users of your website, or application, on the basis of the device they are using (Web, iOS or Android), and even for a web app is possible to choose between two different flows: with or without JavaScript SDK.\n\nI chose to follow the [login flow with Javascript SDK](https://developers.facebook.com/docs/facebook-login/login-flow-for-web) to integrate it into AngularJS.\n\n## Initialize the JavaScript SDK\n\nAfter adding the Facebook JavaScript SDK to our page, needs to call `init` method in the JavaScript SDK as soon as possible, for this reason I will put the initialization code inside the [`run`](https://docs.angularjs.org/api/ng/type/angular.Module#run) method. Moreover this will be the place from which load the SDK itself:\n\n    app.run(['$rootScope', '$window', 'srvAuth', function($rootScope, $window, sAuth) {\n\n      $rootScope.user = {};\n\n      $window.fbAsyncInit = function() {\n        // Executed when the SDK is loaded\n\n        FB.init({ \n\n          /* \n           The app id of the web app;\n           To register a new app visit Facebook App Dashboard\n           ( https://developers.facebook.com/apps/ ) \n          */\n\n          appId: '***************', \n\n          /* \n           Adding a Channel File improves the performance \n           of the javascript SDK, by addressing issues \n           with cross-domain communication in certain browsers. \n          */\n\n          channelUrl: 'app/channel.html', \n\n          /* \n           Set if you want to check the authentication status\n           at the start up of the app \n          */\n\n          status: true, \n\n          /* \n           Enable cookies to allow the server to access \n           the session \n          */\n\n          cookie: true, \n\n          /* Parse XFBML */\n\n          xfbml: true \n        });\n\n        sAuth.watchAuthenticationStatusChange();\n      };\n    }]);\n\nJust a couple of notes before to move to the next paragraph:\n\n*   What is `srvAuth`? Is a custom AngularJS service that I use to wrap all the authentication related stuff.\n*   What is the channel file? It helps dealing with cross-domain communication in certain browsers. The contents of the channel.html file should be just a single line:\n\n    <script src=\"http://connect.facebook.net/en_US/all.js\"></script>\n\nTo end with the initialization tasks, it’s also a good practice to add the fb-root div, that is the place where the Javascript SDK attaches itself to; however if you skip this step the fb-root div will be created automatically. Accomplish this task is so simple that we can do it ourselves; just write the following snippet wherever you want in the body of your page.\n\n## The authentication service\n\nThe service I created is pretty simple: just three methods, and a single property that stores the user’s information retrieved from Facebook.\n\nYou already saw the first method because it’s executed from the previous snippet:\n\n    watchLoginChange = function() {\n\n      var _self = this;\n\n      FB.Event.subscribe('auth.authResponseChange', function(res) {\n\n        if (res.status === 'connected') {\n\n          /* \n           The user is already logged, \n           is possible retrieve his personal info\n          */\n          _self.getUserInfo();\n\n          /*\n           This is also the point where you should create a \n           session for the current user.\n           For this purpose you can use the data inside the \n           res.authResponse object.\n          */\n\n        } \n        else {\n\n          /*\n           The user is not logged to the app, or into Facebook:\n           destroy the session on the server.\n          */\n\n        }\n\n      });\n\n    }\n\nThis method uses the Facebook api to register a callback function that will be executed each time a change to the user authentication status occurs.\n\nWhen the user is logged to Facebook, and also to the web app we receive the connected response status; then it’s possible to retrieve the user personal information from Facebook (using another method offered by the service). Otherwise when the user is not logged to Facebook, or did not granted the web app yet, we have not the permissions to call the Facebook api to retrieve personal information, so in this case we have also to destroy the user’s session on the server, created at the moment of the login.\n\nHow to retrieve user’s personal information from Facebook? Continue the analysis of the service with the `getUserInfo` method:\n\n    getUserInfo = function() {\n\n      var _self = this;\n\n      FB.api('/me', function(res) {\n\n        $rootScope.$apply(function() { \n\n          $rootScope.user = _self.user = res; \n\n        });\n\n      });\n\n    }\n\nThis method simply wraps a call to the Facebook’s service that responds with the user’s profile information. The most important thing to note here is the use of the [$apply](https://docs.angularjs.org/api/ng/type/$rootScope.Scope#$apply) AngularJS method. Infact, because the answer from Facebook is asynchronous, and so it comes from outside the framework world, we need to include it in AngularJS with the `$apply` method.\n\nFinally, the last method of the service provide a way to logout the user from the web application (and from Facebook). However this operation won’t revokes the permission accorded to the app; so when the user will logged to Facebook in the future, he will logged to the app as well.\n\n    logout = function() {\n\n      var _self = this;\n\n      FB.logout(function(response) {\n\n        $rootScope.$apply(function() { \n\n          $rootScope.user = _self.user = {}; \n\n        }); \n\n      });\n\n    }\n\n## The Facebook login button\n\nFinally, is the time to introduce the real star of this post: the Facebook login button… and the good news is that you’ve not more to do that include the following snippet in your web app.\n\n    <fb:login-button show-faces=\"true\" max-rows=\"1\" size=\"large\"></fb:login-button>\n\nHowever probably, sooner or later, you would like to [customize the look of the login button](https://developers.facebook.com/docs/plugins/login-button?locale=it_IT).\n\nEverything I wrote for a generic authentication system is still valid for the login system based on Facebook’s authentication system that I described in this post. Anyway don’t trust the front-end, but repeat each check on the back-end.","permalink":"/post/facebook-authentication-in-angularjs-web-application","site":{"categories":[{"name":"Algorithm","count":1},{"name":"Design","count":10},{"name":"Development","count":38},{"name":"Interview","count":4},{"name":"Mobile-Development","count":1},{"name":"Resources","count":15},{"name":"System Design","count":3},{"name":"System-Design","count":2},{"name":"Tools","count":1},{"name":"Web Management","count":5},{"name":"Web-Development","count":37}],"tags":[{"name":".NET","count":2},{"name":"Algorithm","count":1},{"name":"AngularJS","count":4},{"name":"CSS","count":7},{"name":"HTML","count":4},{"name":"Interview","count":9},{"name":"JavaScript","count":27},{"name":"Mobile","count":1},{"name":"Node.JS","count":8},{"name":"React","count":1},{"name":"Tools","count":1}]}},"__N_SSG":true}