{"pageProps":{"title":"T3 JavaScript Framework for Large-scale Web Applications","description":"T3 is a client-side JavaScript framework for building large-scale web applications. T3 is different than most JavaScript frameworks. It’s meant to be a small piece of an overall architecture that allows you to build scalable client-side code. A T3 application is managed by the Application object, whose primary job is to manage modules, services, and behaviors. It’s the combination of these three types of objects that allow you to build a scalable JavaScript front-end.","date":"2015-05-21T12:58:23.078Z","lastmod":"2015-05-21T12:58:23.078Z","slug":"t3-javascript-framework-for-large-scale-web-applications","categories":["Web-Development","Development"],"tags":["JavaScript"],"thumbnail":"http://rs963.pbsrc.com/albums/ae120/Mirodil/WebSnippet/unnamed_1.jpg~c200","image":"http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/unnamed_1.jpg","source":"http://t3js.org/","content":"\n\n[T3](http://t3js.org/) is a client-side JavaScript framework for building large-scale web applications. T3 is different than most JavaScript frameworks. It’s meant to be a small piece of an overall architecture that allows you to build scalable client-side code. A T3 application is managed by the Application object, whose primary job is to manage modules, services, and behaviors. It’s the combination of these three types of objects that allow you to build a scalable JavaScript front-end.\n\n[T3](http://t3js.org/)’s design enforces best practices such as loose coupling by limiting how certain components can communicate with each other. Modules cannot interact directly with other modules but may communicate with them through an event bus. Modules may use services directly, but may only reference behaviors in a declarative way. These restrictions ensure that the various pieces remain loosely-coupled to make dependency management easy and maintenance self-contained.\n\nThe loosely-coupled nature of [T3](http://t3js.org/) components means that creating tests is easy. Dependencies are injected into each component, making it trivial to substitute a mock object in place of real ones.","permalink":"/post/t3-javascript-framework-for-large-scale-web-applications","site":{"categories":[{"name":"Algorithm","count":1},{"name":"Design","count":10},{"name":"Development","count":38},{"name":"Interview","count":4},{"name":"Mobile-Development","count":1},{"name":"Resources","count":15},{"name":"System Design","count":3},{"name":"System-Design","count":2},{"name":"Tools","count":1},{"name":"Web Management","count":5},{"name":"Web-Development","count":37}],"tags":[{"name":".NET","count":2},{"name":"Algorithm","count":1},{"name":"AngularJS","count":4},{"name":"CSS","count":7},{"name":"HTML","count":4},{"name":"Interview","count":9},{"name":"JavaScript","count":27},{"name":"Mobile","count":1},{"name":"Node.JS","count":8},{"name":"React","count":1},{"name":"Tools","count":1}]}},"__N_SSG":true}