{"pageProps":{"title":"The Top Hybrid Mobile Application Frameworks","description":"You know what they say, if you want to start a flame war have an opinion on HTML5 vs Native mobile app development. I'm reopening this can of worms because the landscape has changed over the past 18 months and surprisingly business are starting to lean toward HTML for upcoming projects lately.","date":"2015-05-22T13:08:33.836Z","lastmod":"2015-05-27T06:04:56.193Z","slug":"the-top-hybrid-mobile-application-frameworks","categories":["Mobile-Development","Development"],"tags":["Mobile","HTML","JavaScript","CSS"],"thumbnail":"http://rs963.pbsrc.com/albums/ae120/Mirodil/WebSnippet/unnamed_9.jpg~c200","image":"http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/unnamed_9.jpg","source":"","content":"\n\nAn HTML application is very attractive if you need to support many types of devices and platforms and you either don't have the internal resources to develop and maintain native applications or you don't have the budget to pay someone to do it for you. It's also a tempting option to just reuse a responsive web application that may already exist and save yourself the headache of a new project.\n\nFor many companies, the application being device agnostic will trump the user experience and app quality every time. If this is an internal application it's easy to get away with it too because the users are your employees and, well, they have no choice. Still, if you talk to the owners of the project, the people who will ultimately be using the application, they want native and they know why they want native more today than they did 2 years ago. Their desire for an improved UI/UX, better speed, and more advanced functionality will suffer at the hands of an IT mandated HTML5 or hybrid application. \n\nThere are many tools and framework available to help you create Mobile applications. Here are we listed some of them.\n\n## [IONIC](http://ionicframework.com/)\n\n![IONIC](http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/unnamed_1.png)\n\n[IONIC](http://ionicframework.com/) is one of the most promising HTML 5 mobile application frameworks. Built using SASS, it provides many UI components to help develop rich and interactive apps. It uses the JavaScript MVVM framework,AngularJS to power apps. Two-way data binding, interaction with backend services and APIs makes AngularJS a mobile developer’s common choice. With the coming release of AngularJS 2.0, focused on mobile, it’s sure to gain even more popularity.\n\n## [Famo.us](http://famous.org/)\n\n![Famo.us](http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/fu.png)\n\n[Famo.us](http://famous.org/) is a free, open source JavaScript framework that helps you create smooth, complex mobile applications. Like Ionic, Famo.us is made for hybrid mobile development, though, up to the point, it can be used for desktop web applications development. Famo.us's mobile framework is a newborn baby. Famo.us development looks more like an animation or a game system than like conventional mobile app design.\n\nBasically, Famo.us uses its own JavaScript engine that works with the GPU acceleration provided by CSS3 3D transformation functions to make animations as smooth as can be at 60 fps. It uses a different approach from other frameworks in order to render DOM elements, by not using the DOM at all - Famo.us creates its own DOM rendering tree. Performance-wise, they have done a great job.\n\n## [Mobile Angular UI](http://mobileangularui.com/)\n\n![Mobile Angular UI](http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/unnamed_2.png)\n\n[Mobile Angular UI](http://mobileangularui.com/) is an HTML 5 framework which uses [bootstrap 3](http://getbootstrap.com/) and AngularJS to create interactive mobile apps. Responsive media queries are stripped out of bootstrap as separate files, you only need to include what you need. Mobile Angular UI doesn’t have any jQuery dependencies, all you need are some AngularJS directives to create awesome mobile user experiences.\n\n## [Appcelerator Titanium](http://www.appcelerator.com/titanium/)\n\n![](http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/unnamed_3.png)\n\n[Appcelerator’s Titanium](http://www.appcelerator.com/titanium/) is an open source mobile application framework that provides an environment to create native apps for several mobile platforms. Titanium is a complete solution for creating hybrid mobile apps with all you need in one place. To get started with Titanium download [Titanium studio](http://www.appcelerator.com/titanium/titanium-studio/). The Titanium SDK is equipped with a number of mobile platform APIs and Cloud service to use as an app backend. It comes with platform independent APIs which makes it easier to access phone hardware.\n\n## [Sencha Touch](http://www.sencha.com/products/touch/)\n\n![](http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/unnamed_4.png)\n\n[Sencha Touch](http://www.sencha.com/products/touch/) is an HTML 5 mobile app framework for creating apps for several platforms including iOS, Android and Blackberry. It has been in existence for some years now and is popular among hybrid mobile application developers. Sencha Touch scores highly against it’s competitors by providing a native look and feel across all of the platforms it supports.\n\n## [Kendo UI](http://www.telerik.com/kendo-ui)\n\n![](http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/Untitled.png)\n\n[Kendo UI](http://www.telerik.com/kendo-ui) is an HTML 5 framework for creating cross platform mobile applications. Kendo UI relies heavily on jQuery and has a number of jQuery based widgets.\n\nLearning Kendo UI is not difficult, developers familiar with jQuery will find Kendo UI easy to learn. [Kendo UI has open sourced](http://techcrunch.com/2014/04/18/telerik-open-sources-most-of-its-kendo-ui-html5-framework/) most of Kendo UI’s toolset and JavaScript framework features. However most of the commonly used widgets are still under a commercial license.\n\n## [PhoneGap](http://phonegap.com/)\n\n![PhoneGap](http://i963.photobucket.com/albums/ae120/Mirodil/WebSnippet/unnamed_5.png)\n\n[PhoneGap](http://phonegap.com/) is the odd one out in this list as it’s not a framework for creating an app, but for packaging and releasing an app. PhoneGap is based on the open source [Cordova](http://cordova.apache.org/) and is the commercial version owned by[Adobe](http://www.adobe.com/). With a dedicated support team, PhoneGap is popular amongst many mobile developers.\n\n## [Onsen UI](http://onsen.io/)\n\n![Onsen.io](http://i1135.photobucket.com/albums/m637/Maer007/WebSnippet/unnamed_zpsdtfeaxcr.png)\n\n[Onsen UI](http://onsen.io/) is the Javascript and CSS frameworks for HTML5, PhoneGap & Cordova apps with UI components.\n\n## [RAD.JS](http://rad-js.com/)\n\n![](http://i1135.photobucket.com/albums/m637/Maer007/WebSnippet/1432706659171_zpsbw8sspv8.png)\n\n<span style=\"font-family:proxima-nova-soft,sans-serif; font-size:17.007999420166px\">[RAD.JS](http://rad-js.com/) is a mobile app framework for all major mobile systems and even Web browsers. It focuses on ease of use and speed.</span>","permalink":"/post/the-top-hybrid-mobile-application-frameworks","site":{"categories":[{"name":"Algorithm","count":1},{"name":"Design","count":10},{"name":"Development","count":38},{"name":"interview","count":2},{"name":"intreview","count":2},{"name":"Mobile-Development","count":1},{"name":"Resources","count":15},{"name":"System Design","count":2},{"name":"System-Design","count":2},{"name":"Tools","count":1},{"name":"Web Management","count":5},{"name":"Web-Development","count":37}],"tags":[{"name":".NET","count":2},{"name":"Algorithm","count":1},{"name":"AngularJS","count":4},{"name":"CSS","count":7},{"name":"HTML","count":4},{"name":"interview","count":5},{"name":"interviews","count":1},{"name":"intreview","count":2},{"name":"JavaScript","count":27},{"name":"Mobile","count":1},{"name":"Node.JS","count":8},{"name":"React","count":1},{"name":"Tools","count":1}]}},"__N_SSG":true}